XML/sampleRequest.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><soap:Header><wsa:Action/><wsa:MessageID>urn:uuid:13b4acb4-cbed-4a44-9653-b0ec61887690</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>https://ukid.uat.uk.experian.com/EIHEndpoint</wsa:To><wsse:Security><wsu:Timestamp wsu:Id="Timestamp-eae374ac-2b08-4085-b056-d7a978ab5bfe"><wsu:Created>2012-08-30T07:31:25Z</wsu:Created><wsu:Expires>2012-08-31T07:26:25Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" ValueType="ExperianWASP" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" wsu:Id="SecurityToken-360cdfd9-0664-4a65-a0f0-92a0229bf83a">1B-E6-55-D2-3F-BE-A4-2B-5A-7A-B7-1E-0C-03-73-C0-9F-C5-EA-93-84-9E-27-14-DA-ED-BD-CC-FB-FA-A2-E8-D0-5E-32-A3-D9-FF-14-95-82-4F-5A-90-10-68-37-C7-D4-B7-5F-A9-F9-10-B8-E5-1F-C8-4F-E6-0F-87-49-0C-6A-22-5A-1F-88-5B-57-AE-70-F5-CF-E8-EA-0C-63-0D-54-D7-20-24-C9-05-4B-1E-DB-AD-A8-F5-B0-9A-F6-FA-D2-DB-CE-33-04-09-74-7B-B6-74-EC-33-27-29-07-82-C3-E2-71-F5-22-90-8D-A3-6E-61-2F-FB-8D-A2-D6-BC-10-9C-FE-90-5F-E5-B4-14-32-D7-1D-90-CE-F3-62-EE-04-6B-57-50-10-1C-91-43-3F-69-51-50-18-36-AF-86-C5-BC-FC-50-A3-44-39-0D-A9-7F-62-67-0A-D3-13-CF-C7-0B-0C-CB-E9-BC-30-FA-7B-F7-C9-25-9F-35-28-74-80-0F-33-11-E1-EF-B8-4B-62-5C-4A-D5-22-ED-29-0F-12-C0-7C-3B-44-20-E9-4C-3B-2D-1F-1B-6A-05-34-D1-21-E6-90-52-59-53-52-82-43-98-F1-5F-B2-69-5D-6B-99-76-04-29-96-2D-99-94-A8-10-85-1D-19-21-B5-A0-D0-1B-ED-53-E0-C3-B4-8A-61-2C-45-7C-77-FB-0A-D8-3B-38-D5-5C-46-59-0E-89-F8-3E-EE-4E-04-AD-8A-0E-10-70-34-41-0D-2B-CE-18-9D-04-05-ED-C6-63-ED-E1-B0-FB-8A-8C-8D-1C-31-B6-AE-D2-66-21-90-4B-D8-87-32-0F-A8-2F-1D-11-0C-0C-BF-0F-6F-96-A5-AB-76-6D-B6-B1-C3-DD-DE-B9-97-38-EF-E2-E6-C7-EA-C4-2F-F5-51-08-45-43-DD-E4-A9-82-3A-28-6A-18-F9-4F-95-C1-0E-E2-BA-C2-52-A2-63-D6-30-20-52-E1-A2-27-9F-5B-EA-F9-EF-58-5E-9A-E3-E2-79-85-4A-D9-03-96-BB-C6-6F-22-CF-7B-2A-1B-03-0B-14-E7-08-89-15-32-77-AC-31-47-E0-9F-5A-0A-50-D1-9C-C1-CD-4C-01-62-3B-0A-1E-5D-F3-1B-80-B2-84-C0-A4-55-46-1F-4F-FE-EE-0C-7F-9E-90-F3-98-F6-05-4A-9D-E9-BD-7F-AE-18-D8-31-BD-C5-66-35-3D-91-12-79</wsse:BinarySecurityToken></wsse:Security></soap:Header><soap:Body><ExecuteRequest xmlns="http://schema.uk.experian.com/eih/2011/03"><EIHHeader xmlns="http://schema.uk.experian.com/eih/2011/03/EIHHeader"><ClientUser>ADL</ClientUser><ReferenceId>ADL1EXT329</ReferenceId></EIHHeader><ProcessConfigReference><ProcessConfigName>CRB Check</ProcessConfigName></ProcessConfigReference><ResponseType>Decision Only</ResponseType><Consent>Yes</Consent><PersonalData><Name><Forename>TESTNAV</Forename><MiddleName></MiddleName><Surname>TESTNAV</Surname></Name><BirthDate>1983-08-30</BirthDate></PersonalData><Addresses><Address><AddressDetail><FlatOrApartmentNumber></FlatOrApartmentNumber><HouseName></HouseName><HouseNumber>House1</HouseNumber><Address1>ADDRESS1</Address1><Address2>ADDRESS2</Address2><Address3>TOWN 1</Address3><Address4>COUNTY 1</Address4><PostCode>NR1 2DH</PostCode><Country>GB</Country></AddressDetail><TypeOfAddress>UK</TypeOfAddress><AddressStatus>Current</AddressStatus><ResidentFrom>2000-08-30</ResidentFrom><ResidentTo>2012-08-30</ResidentTo></Address></Addresses></ExecuteRequest></soap:Body></soap:Envelope>
